In [12]:
import datetime
import pandas as pd
import numpy as np

In [2]:
intraday = pd.DataFrame(columns=['date', 'price'])

with open("//home/ostapkharysh/Documents/bachelor_thesis/additional_data/34_amzn.txt", "r") as stock:
    for line in stock:
        el = line.split(" ")[0]+" "+ line.split(" ")[1]
        data = datetime.datetime.strptime(line.split(" ")[0]+" "+ line.split(" ")[1], '%Y-%m-%d %H:%M:%S')
        intraday = intraday.append({'date': data, 'price': float(line.split(" ")[-1].strip())}, ignore_index = True)

In [3]:
intraday[intraday.date<'2016-01-05']

                   date    price
0   2016-01-04 09:45:00  649.180
1   2016-01-04 09:46:00  648.700
2   2016-01-04 09:47:00  649.460
3   2016-01-04 09:48:00  650.000
4   2016-01-04 09:49:00  651.059
5   2016-01-04 09:50:00  650.630
6   2016-01-04 09:51:00  650.120
7   2016-01-04 09:52:00  649.620
8   2016-01-04 09:53:00  649.690
9   2016-01-04 09:54:00  649.691
10  2016-01-04 09:55:00  649.790
11  2016-01-04 09:56:00  649.680
12  2016-01-04 09:57:00  650.187
13  2016-01-04 09:58:00  650.200
14  2016-01-04 09:59:00  649.071
15  2016-01-04 10:00:00  647.000
16  2016-01-04 10:01:00  647.700
17  2016-01-04 10:02:00  645.781
18  2016-01-04 10:03:00  646.050
19  2016-01-04 10:04:00  643.663
20  2016-01-04 10:05:00  643.000
21  2016-01-04 10:06:00  642.750
22  2016-01-04 10:07:00  642.720
23  2016-01-04 10:08:00  641.830
24  2016-01-04 10:09:00  641.450
25  2016-01-04 10:10:00  641.920
26  2016-01-04 10:11:00  639.950
27  2016-01-04 10:12:00  638.670
28  2016-01-04 10:13:00  639.590
29  2016-01-04 10:14:00  639.130
..                  ...      ...
331 2016-01-04 15:16:00  629.010
332 2016-01-04 15:17:00  629.918
333 2016-01-04 15:18:00  629.840
334 2016-01-04 15:19:00  630.650
335 2016-01-04 15:20:00  630.998
336 2016-01-04 15:21:00  630.748
337 2016-01-04 15:22:00  630.263
338 2016-01-04 15:23:00  629.718
339 2016-01-04 15:24:00  629.880
340 2016-01-04 15:25:00  630.280
341 2016-01-04 15:26:00  630.777
342 2016-01-04 15:27:00  630.640
343 2016-01-04 15:28:00  630.480
344 2016-01-04 15:29:00  630.417
345 2016-01-04 15:30:00  630.350
346 2016-01-04 15:31:00  630.609
347 2016-01-04 15:32:00  630.570
348 2016-01-04 15:33:00  630.898
349 2016-01-04 15:34:00  630.000
350 2016-01-04 15:35:00  630.020
351 2016-01-04 15:36:00  629.470
352 2016-01-04 15:37:00  629.921
353 2016-01-04 15:38:00  629.260
354 2016-01-04 15:39:00  629.700
355 2016-01-04 15:40:00  629.723
356 2016-01-04 15:41:00  630.450
357 2016-01-04 15:42:00  630.196
358 2016-01-04 15:43:00  630.075
359 2016-01-04 15:44:00  629.990
360 2016-01-04 15:45:00  630.524

[361 rows x 2 columns]

In [4]:
intraday.tail()

                     date    price
90155 2016-12-30 15:41:00  750.097
90156 2016-12-30 15:42:00  749.793
90157 2016-12-30 15:43:00  749.250
90158 2016-12-30 15:44:00  749.448
90159 2016-12-30 15:45:00  749.567

In [5]:
intraday = intraday[pd.to_datetime(intraday['date'].values).minute % 15 == 0]
intraday = intraday.reset_index(drop=True)

In [6]:
intraday.tail()

                    date    price
6240 2016-12-30 14:45:00  750.319
6241 2016-12-30 15:00:00  748.740
6242 2016-12-30 15:15:00  750.284
6243 2016-12-30 15:30:00  750.610
6244 2016-12-30 15:45:00  749.567

In [7]:
res = [np.log(intraday.price[idx]/intraday.price[idx-1]) for idx in range(1, len(intraday.price))]

In [8]:
intraday = intraday[1:]
intraday['fin_return'] = res

In [9]:
intraday.head()

                 date    price  fin_return
1 2016-01-04 10:00:00  647.000   -0.003364
2 2016-01-04 10:15:00  638.380   -0.013413
3 2016-01-04 10:30:00  640.678    0.003593
4 2016-01-04 10:45:00  639.550   -0.001762
5 2016-01-04 11:00:00  638.440   -0.001737

In [10]:
#convert ET to UTC
step = datetime.timedelta(hours=4)
intraday['date'] +=step

In [11]:
intraday.head()

                 date    price  fin_return
1 2016-01-04 14:00:00  647.000   -0.003364
2 2016-01-04 14:15:00  638.380   -0.013413
3 2016-01-04 14:30:00  640.678    0.003593
4 2016-01-04 14:45:00  639.550   -0.001762
5 2016-01-04 15:00:00  638.440   -0.001737

In [12]:
intraday.to_csv("stocks/ET/AMZNReturn.csv", index=False)

In [25]:
fb = pd.read_csv('//home/ostapkharysh/Documents/bachelor_thesis/additional_data/2016_fb.csv', header=None)

In [26]:
fb = fb[[0,1, 2]]

In [27]:
fb[0] = fb[0].astype(str)
fb[1] = fb[1].astype(str)
fb['price'] = fb[2]

In [28]:
fb.tail()

               0     1       2   price
149973  20161230  1951  115.12  115.12
149974  20161230  1952  115.12  115.12
149975  20161230  1955  115.12  115.12
149976  20161230  1957  115.12  115.12
149977  20161230  1959  115.15  115.15

In [29]:
fb[1] = ["0"+el if len(el)<4 else el for el in fb[1].values]

In [30]:
fb['date'] = fb[0].str.cat(fb[1],sep="")
fb['date'] = fb[0].map(str)+fb[1]

/usr/local/lib/python3.5/dist-packages/pandas/core/computation/check.py:17: UserWarning: The installed version of numexpr 2.4.3 is not supported in pandas and will be not be used
The minimum supported version is 2.4.6

  ver=ver, min_ver=_MIN_NUMEXPR_VERSION), UserWarning)

In [31]:
fb = fb[['date', 'price']]

In [32]:
fb.head()

           date   price
0  201601040701  102.09
1  201601040702  102.04
2  201601040703  102.00
3  201601040704  102.06
4  201601040705  102.06

In [33]:
fb['date'] = pd.to_datetime(fb.date)

fb = fb[pd.to_datetime(fb['date'].values).minute % 15 == 0]
fb = fb.reset_index(drop=True)



res = [np.log(fb.price[idx]/fb.price[idx-1]) for idx in range(1, len(fb.price))]
fb = fb[1:]
fb['fin_return'] = res

In [34]:
fb.head()

                 date   price  fin_return
1 2016-01-04 07:30:00  102.02   -0.001567
2 2016-01-04 07:45:00  102.00   -0.000196
3 2016-01-04 08:00:00  102.00    0.000000
4 2016-01-04 08:15:00  102.30    0.002937
5 2016-01-04 08:30:00  102.25   -0.000489

In [35]:
#convert ET to UTC
step = datetime.timedelta(hours=4)
fb['date'] +=step

In [36]:
fb.head()

                 date   price  fin_return
1 2016-01-04 11:30:00  102.02   -0.001567
2 2016-01-04 11:45:00  102.00   -0.000196
3 2016-01-04 12:00:00  102.00    0.000000
4 2016-01-04 12:15:00  102.30    0.002937
5 2016-01-04 12:30:00  102.25   -0.000489

In [10]:
fb.to_csv("stocks/ET/FBReturn.csv", index=False)

NameError: name 'fb' is not defined

In [26]:
dt1 = pd.read_csv("//home/ostapkharysh/Documents/bt_data/DescriptiveFebruary29June05_2016/ET/FB/FIN1.csv")
dt2 = pd.read_csv("//home/ostapkharysh/Documents/bt_data/DescriptiveFebruary29June05_2016/ET/FB/FIN2.csv")
dt3 = pd.read_csv("//home/ostapkharysh/Documents/bt_data/DescriptiveFebruary29June05_2016/ET/FB/FIN3.csv")

In [27]:
dt = dt1.append(dt2)
dt = dt.append(dt3)

In [28]:
dt.tail()

,activ_den,date,fin_return,negative,polarity,positive,self_den,tone
2970,19.987999,2016-06-04 22:45:00,NaN,3.335539,5.575519,2.239979,0.798160,-1.095560
2971,20.385937,2016-06-04 23:00:00,NaN,2.992500,6.056016,3.063516,1.334546,0.071016
2972,23.525880,2016-06-04 23:15:00,NaN,3.351339,7.339864,3.988525,1.637245,0.637186
2973,23.595086,2016-06-04 23:30:00,NaN,2.944155,7.044463,4.100308,1.718972,1.156153
2974,23.079274,2016-06-04 23:45:00,NaN,2.615680,6.131705,3.516024,1.565597,0.900344

In [29]:
dt.to_csv("//home/ostapkharysh/Documents/bt_data/DescriptiveFebruary29June05_2016/ET/FB/FT.csv")